Autodesk.Revit.DB.SpatialElement.Perimeter
The perimeter.

Autodesk.Revit.DB.SpatialElement.Area
The area.

Autodesk.Revit.DB.SpatialElement.Location
The location of the element.
Remarks: This is the location of the room within the level. The
Z location should be the elevation of the level and not changeable.

Autodesk.Revit.DB.SpatialElement.Number
The number.

Autodesk.Revit.DB.SpatialElement.GetBoundarySegments(Autodesk.Revit.DB.SpatialElementBoundaryOptions)
Returns the boundary segments.
options: The SpatialElementBoundaryOptions.
Remarks: This method is used to retrieve the segments that constitute the boundary of the spatial element.
Each spatial element may have several regions, each of which have several segments hence the data is returned
in the form of an array of boundary segment arrays. See the BoundarySegment object for more
details about the segments that make up the spatial element topology.
Since: 2012

Autodesk.Revit.DB.SpatialElement.Level
Gets the level of the room.

Autodesk.Revit.DB.SpatialElement.Name
A human readable name for the Element.
Remarks: The Name property is a human readable name for the element, such as Wall.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when the name of the element cannot be changed.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the element requires a unique name and a non-unique name is set.

Autodesk.Revit.DB.SpatialElement
Represents an enclosed area or volume in the Revit model.  This is the parent class for
rooms, spaces and areas.